<div style="font-size: 20px; text-align: center;">
<b>Case Study Title:
Employee Data Analysis Using Python and Pandas</b>
</div>

### Objective :

#### The objective of this case study is to analyze employee data to gain insights into workforce demographics, salary trends, performance metrics, and work preferences within a hypothetical organization. By leveraging this dataset, Analyzed organizational employee data to gain insights into workforce demographics, salaries, performance trends, and work preferences to assist in strategic decision-making.

In [1]:
import numpy as np
import pandas as pd

In [2]:
df= pd.read_csv('Employee_Data_Case_Study.csv')

### Print the first five rows of a DataFrame.

In [3]:
df.head(5)

,EmployeeID,Name,Age,Gender,Department,Salary,JoinDate,PerformanceRating,Education Level,Location/Address,Leaves Taken,WorkShift,Mode of Work
0,1,Derek Hill,44,Other,Operations,24128,2023-10-02,3,Bachelor's,Port Isaacchester,0,Day,Hybrid
1,2,Kevin Cabrera,34,Female,Operations,65971,2012-02-03,3,Bachelor's,Nguyenbury,20,Night,Hybrid
2,3,Rebekah Lopez,58,Other,IT,26271,2005-02-20,3,PhD,Lake David,15,Night,Hybrid
3,4,James Patterson,33,Male,IT,40799,2016-06-27,3,PhD,North Debraborough,0,Rotational,Hybrid
4,5,Alexander Powell,29,Female,IT,34860,2007-07-27,3,PhD,East Joyce,18,Rotational,Hybrid

### Print the shape of dataframe

In [39]:
df.shape

(50000, 17)

### Print the column names and data types of a DataFrame.

In [34]:
df.columns

Index(['EmployeeID', 'Name', 'Age', 'Gender', 'Department', 'Salary',
       'JoinDate', 'PerformanceRating', 'Education Level', 'Location/Address',
       'Leaves Taken', 'WorkShift', 'Mode of Work', 'AgeGroup', 'Tenure',
       'Rank', 'Leave_Rank'],
      dtype='object')

In [35]:
df.dtypes

EmployeeID                    int64
Name                         object
Age                           int64
Gender                       object
Department                   object
Salary                        int64
JoinDate             datetime64[ns]
PerformanceRating             int64
Education Level              object
Location/Address             object
Leaves Taken                  int64
WorkShift                    object
Mode of Work                 object
AgeGroup                     object
Tenure                        int32
Rank                        float64
Leave_Rank                  float64
dtype: object

### Check for missing values in a DataFrame.

In [36]:
df.isnull().sum()

EmployeeID           0
Name                 0
Age                  0
Gender               0
Department           0
Salary               0
JoinDate             0
PerformanceRating    0
Education Level      0
Location/Address     0
Leaves Taken         0
WorkShift            0
Mode of Work         0
AgeGroup             0
Tenure               0
Rank                 0
Leave_Rank           0
dtype: int64

### Generate summary statistics (mean, median, standard deviation, etc.) for numeric columns in the DataFrame.

In [37]:
df.describe()

,EmployeeID,Age,Salary,PerformanceRating,Leaves Taken,Tenure,Rank,Leave_Rank
count,50000.000000,50000.000000,50000.000000,50000.000000,50000.000000,50000.000000,50000.00000,50000.000000
mean,25000.500000,41.520580,110215.257460,3.004540,14.979580,9.537440,4069.26448,16.020420
std,14433.901067,13.846915,51903.260025,1.413449,8.917432,5.762706,2349.99674,8.917432
min,1.000000,18.000000,20000.000000,1.000000,0.000000,0.000000,1.00000,1.000000
25%,12500.750000,30.000000,65487.750000,2.000000,7.000000,5.000000,2033.00000,8.000000
50%,25000.500000,42.000000,110412.000000,3.000000,15.000000,10.000000,4068.00000,16.000000
75%,37500.250000,53.000000,155064.500000,4.000000,23.000000,15.000000,6103.00000,24.000000
max,50000.000000,65.000000,199998.000000,5.000000,30.000000,20.000000,8284.00000,31.000000

### Print the total number of employees

In [4]:
total_employees = df['EmployeeID'].count()
total_employees

50000

### How many employees are in each department?

In [5]:
department_count = df.Department.value_counts()
department_count

Operations    8489
HR            8428
Sales         8329
IT            8289
Marketing     8237
Finance       8228
Name: Department, dtype: int64

### What is the average salary of employees in each department?

In [40]:
average_salary = df.groupby('Department')['Salary'].mean()
average_salary

Department
Finance       111370.365702
HR            109925.846464
IT            110745.809024
Marketing     110128.752458
Operations    110016.386854
Sales         109127.244207
Name: Salary, dtype: float64

### What is the gender distribution in the dataset?

In [7]:
gender_dist = df.Gender.value_counts()
gender_dist

Other     16736
Male      16718
Female    16546
Name: Gender, dtype: int64

### What is the minimum and maximum salary in the dataset?

In [8]:
min_salary = df['Salary'].min()
min_salary

20000

In [9]:
max_salary = df['Salary'].max()
max_salary

199998

### How many employees have a performance rating of 5?

In [10]:
top_performers_count = len(df[df['PerformanceRating'] == 5])
top_performers_count

10068

### Find the most common education level among employees.

In [11]:
most_common_education = df['Education Level'].mode()[0]
most_common_education

"Master's"

### What is the earliest and latest joining date in the dataset?

In [12]:
earliestDate = df['JoinDate'].min()
earliestDate

'2004-12-05'

In [13]:
latestDate = df['JoinDate'].max()
latestDate

'2024-12-04'

### Identify employees who have taken more than 20 leaves.

In [14]:
high_leaves = df[df['Leaves Taken'] > 20][['EmployeeID','Name','Department','Leaves Taken']]
high_leaves

       EmployeeID              Name  Department  Leaves Taken
5               6    Scott Jacobson          IT            24
12             13        Shawn Cook     Finance            21
14             15  Andrew Stevenson  Operations            23
16             17        Mary Clark       Sales            21
20             21      Joshua Smith  Operations            30
...           ...               ...         ...           ...
49979       49980   Sherry Ferguson          IT            23
49981       49982  Kathy Fitzgerald       Sales            24
49984       49985      Justin Blake       Sales            25
49996       49997      Edward Combs     Finance            24
49999       50000      Rachel Brown       Sales            24

[16050 rows x 4 columns]

### Find the average salary of employees grouped by both department and gender.

In [15]:
avg_salary_by_dept_gender = df.groupby(['Department','Gender'])['Salary'].mean()
avg_salary_by_dept_gender

Department  Gender
Finance     Female    111161.084683
            Male      111384.707199
            Other     111557.563758
HR          Female    110471.606528
            Male      108568.365257
            Other     110775.855344
IT          Female    110251.781531
            Male      111445.292010
            Other     110533.146593
Marketing   Female    109839.224012
            Male      109724.688188
            Other     110809.742353
Operations  Female    110158.626930
            Male      110050.622992
            Other     109846.895281
Sales       Female    107421.695842
            Male      109768.564381
            Other     110169.281788
Name: Salary, dtype: float64

### Which department has the highest average salary?

In [16]:
avg_salary_by_dept = df.groupby('Department')['Salary'].mean()
highest_avg_sal_dept = avg_salary_by_dept.idxmax()
highest_avg_sal_dept

'Finance'

### What is the average performance rating for each work shift?

In [17]:
avg_rating_by_shift = df.groupby('WorkShift')['PerformanceRating'].mean()
avg_rating_by_shift

WorkShift
Day           2.996809
Night         3.011930
Rotational    3.004812
Name: PerformanceRating, dtype: float64

### How many employees are working in each mode of work?

In [18]:
mode_of_work_count = df['Mode of Work'].value_counts()
mode_of_work_count

Remote     16754
On-site    16692
Hybrid     16554
Name: Mode of Work, dtype: int64

### Find the average number of leaves taken by employees in each department.

In [19]:
avg_leaves_by_dept = df.groupby('Department')['Leaves Taken'].mean()
avg_leaves_by_dept

Department
Finance       14.885513
HR            14.957404
IT            15.018941
Marketing     15.110720
Operations    14.912122
Sales         14.994837
Name: Leaves Taken, dtype: float64

### Identify the top 5 departments with the highest total salary expenditure.

In [20]:
total_salary_by_dept = df.groupby('Department')['Salary'].sum()
top_5_dept = total_salary_by_dept.sort_values(ascending=False).head(5)
top_5_dept

Department
Operations    933929108
HR            926455034
IT            917972011
Finance       916355369
Sales         908920817
Name: Salary, dtype: int64

### Find the age group (e.g., 18-25, 26-35, etc.) with the highest average performance rating.

In [21]:
def group_age(age):
    
    if age < 25:
        return "18-25"
    elif age < 35:
        return "25-35"
    elif age < 45:
        return "35-45"
    elif age < 55:
        return "45-55"
    else:
        return "55+"

In [22]:
df['AgeGroup'] = df['Age'].apply(group_age)

In [23]:
avg_rating_by_age_group = df.groupby('AgeGroup')['PerformanceRating'].mean()

In [24]:
highest_rating_age_group = avg_rating_by_age_group.idxmax()
highest_rating_age_group

'18-25'

###  Identify the top 3 cities with the highest number of employees.

In [25]:
top_3_cities = df['Location/Address'].value_counts().head(3)
top_3_cities

Port Michael     54
New Michael      48
South Michael    47
Name: Location/Address, dtype: int64

### Create a new column Tenure to show the number of years each employee has been with the company

In [26]:
df['JoinDate'] = pd.to_datetime(df['JoinDate'])

In [27]:
df['Tenure'] = ((pd.Timestamp.now() - df['JoinDate']).dt.days / 365).astype(int)

In [28]:
df

,EmployeeID,Name,Age,Gender,Department,Salary,JoinDate,PerformanceRating,Education Level,Location/Address,Leaves Taken,WorkShift,Mode of Work,AgeGroup,Tenure
0,1,Derek Hill,44,Other,Operations,24128,2023-10-02,3,Bachelor's,Port Isaacchester,0,Day,Hybrid,35-45,1
1,2,Kevin Cabrera,34,Female,Operations,65971,2012-02-03,3,Bachelor's,Nguyenbury,20,Night,Hybrid,25-35,12
2,3,Rebekah Lopez,58,Other,IT,26271,2005-02-20,3,PhD,Lake David,15,Night,Hybrid,55+,19
3,4,James Patterson,33,Male,IT,40799,2016-06-27,3,PhD,North Debraborough,0,Rotational,Hybrid,25-35,8
4,5,Alexander Powell,29,Female,IT,34860,2007-07-27,3,PhD,East Joyce,18,Rotational,Hybrid,25-35,17
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
49995,49996,Justin Stout,55,Male,Marketing,91980,2011-05-18,2,High School,Daviston,12,Rotational,On-site,55+,13
49996,49997,Edward Combs,27,Male,Finance,111662,2010-07-16,1,Bachelor's,East Lawrence,24,Night,On-site,25-35,14
49997,49998,Courtney Ferguson,61,Female,IT,64917,2019-01-16,2,Master's,Arellanofort,6,Rotational,Hybrid,55+,5
49998,49999,Michelle Jacobs,65,Other,Marketing,85729,2017-04-08,2,High School,East Danielton,8,Rotational,Remote,55+,7
49999,50000,Rachel Brown,65,Other,Sales,169020,2016-07-29,3,PhD,West Keithmouth,24,Rotational,On-site,55+,8

### Identify employees who have been with the organization for more than 10 years.

In [29]:
ten_year_employees = df[df['Tenure'] > 10]
ten_year_employees

,EmployeeID,Name,Age,Gender,Department,Salary,JoinDate,PerformanceRating,Education Level,Location/Address,Leaves Taken,WorkShift,Mode of Work,AgeGroup,Tenure
1,2,Kevin Cabrera,34,Female,Operations,65971,2012-02-03,3,Bachelor's,Nguyenbury,20,Night,Hybrid,25-35,12
2,3,Rebekah Lopez,58,Other,IT,26271,2005-02-20,3,PhD,Lake David,15,Night,Hybrid,55+,19
4,5,Alexander Powell,29,Female,IT,34860,2007-07-27,3,PhD,East Joyce,18,Rotational,Hybrid,25-35,17
10,11,Gregg Strickland,59,Male,IT,54055,2009-04-17,2,Bachelor's,West Jerry,7,Night,On-site,55+,15
12,13,Shawn Cook,59,Other,Finance,184539,2011-01-02,3,Master's,Palmermouth,21,Rotational,On-site,55+,13
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
49990,49991,Michael Simpson,44,Female,HR,80310,2011-11-12,3,Bachelor's,West James,6,Rotational,Hybrid,35-45,13
49993,49994,Cindy Griffin,61,Male,Operations,88251,2009-05-08,5,High School,Grayview,16,Rotational,Hybrid,55+,15
49994,49995,Christopher Brewer,34,Female,IT,53671,2006-07-03,4,Bachelor's,East Robert,13,Day,Hybrid,25-35,18
49995,49996,Justin Stout,55,Male,Marketing,91980,2011-05-18,2,High School,Daviston,12,Rotational,On-site,55+,13
49996,49997,Edward Combs,27,Male,Finance,111662,2010-07-16,1,Bachelor's,East Lawrence,24,Night,On-site,25-35,14

### Identify the top 5 performing employees in terms of salary in each department. Display their EmployeeID, Name, Age, Gender, Department

In [30]:
df_sorted = df.sort_values(by=['Department','Salary'], ascending=[True,False])
df['Rank'] = df_sorted.groupby('Department')['Salary'].rank(method='dense', ascending=False)
top_performing_emp = df[df['Rank'] <= 5][['EmployeeID','Name','Age','Gender','Education Level','Department','Salary','Rank']]
top_performing_emp.sort_values(by=['Department','Salary'], ascending=[True,False])

,EmployeeID,Name,Age,Gender,Education Level,Department,Salary,Rank
35805,35806,Mrs. Alyssa Vargas,29,Other,Bachelor's,Finance,199929,1.0
36038,36039,Tamara Gordon,64,Other,High School,Finance,199918,2.0
49132,49133,Rachel Love,53,Female,High School,Finance,199907,3.0
28765,28766,Kelli Mason,61,Other,PhD,Finance,199897,4.0
37940,37941,Paul Schroeder,30,Male,Master's,Finance,199886,5.0
7730,7731,Shannon Porter,18,Male,PhD,HR,199998,1.0
4216,4217,Jennifer Powell,60,Female,PhD,HR,199975,2.0
14533,14534,Melissa Alvarez,35,Male,Master's,HR,199973,3.0
24636,24637,Dennis Green,43,Female,PhD,HR,199923,4.0
39963,39964,Brenda Gibson,35,Male,Bachelor's,HR,199824,5.0
21957,21958,Brendan Miller,65,Female,Master's,IT,199990,1.0
4391,4392,Martin Martin,63,Female,Bachelor's,IT,199983,2.0
29856,29857,Ashley Jones,32,Male,PhD,IT,199938,3.0
8725,8726,Kevin Combs,18,Other,Bachelor's,IT,199917,4.0
22693,22694,Margaret Holder,42,Male,Master's,IT,199869,5.0
44860,44861,Monique Stout,41,Female,Master's,Marketing,199992,1.0
6334,6335,Stephen Combs,59,Male,Bachelor's,Marketing,199965,2.0
46750,46751,Tonya Andrews,27,Male,PhD,Marketing,199945,3.0
16361,16362,Carolyn Mclaughlin,56,Male,High School,Marketing,199943,4.0
44055,44056,Holly Hamilton,52,Male,PhD,Marketing,199931,5.0
9061,9062,Patrick Phillips,26,Other,PhD,Operations,199953,1.0
21515,21516,Dillon Lewis,65,Female,High School,Operations,199928,2.0
27446,27447,Patrick Freeman,39,Male,Master's,Operations,199916,3.0
27174,27175,Benjamin Rivera,19,Male,Bachelor's,Operations,199859,4.0
4367,4368,Laurie Chan,46,Male,Bachelor's,Operations,199842,5.0
11449,11450,Cheryl Byrd,62,Other,Master's,Sales,199984,1.0
25248,25249,Gina Miller,64,Female,Master's,Sales,199947,2.0
13141,13142,Wyatt Thompson,54,Male,Master's,Sales,199944,3.0
42761,42762,Natasha Soto,21,Female,Bachelor's,Sales,199944,3.0
23997,23998,Monica Smith,45,Female,Bachelor's,Sales,199911,4.0
5401,5402,Kyle Miller,52,Female,High School,Sales,199907,5.0

### Determine how many employees in each department have a PerformanceRating of 5.

In [31]:
high_performance_rating = df[df['PerformanceRating'] == 5].groupby('Department').size()
high_performance_rating

Department
Finance       1662
HR            1676
IT            1697
Marketing     1629
Operations    1697
Sales         1707
dtype: int64

### Determine how many employees in each department have a PerformanceRating of 1.

In [42]:
low_performance_rating = df[df['PerformanceRating'] == 1].groupby('Department').size()
low_performance_rating

Department
Finance       1633
HR            1774
IT            1610
Marketing     1645
Operations    1685
Sales         1576
dtype: int64

### Identify the employee who have taken maximum number of leaves in each department. Display their EmployeeID, Name, Age, Gender, Department, Leaves

In [32]:
max_leave_emp = df.sort_values(['Department','Leaves Taken'], ascending=[True,False])
df['Leave_Rank'] = max_leave_emp.groupby('Department')['Leaves Taken'].rank(method='dense',ascending=False)
emp_with_max_leaves = df[df['Leave_Rank'] == 1][['EmployeeID','Name','Age','Gender','Department','Leaves Taken']]
emp_with_max_leaves.sort_values(['Department','Leaves Taken'], ascending=[True,False]).reset_index()

,index,EmployeeID,Name,Age,Gender,Department,Leaves Taken
0,246,247,Phillip Johnson,26,Female,Finance,30
1,344,345,Jennifer Wood,61,Male,Finance,30
2,511,512,Eugene Anderson MD,41,Male,Finance,30
3,860,861,Cody Martin,49,Female,Finance,30
4,910,911,Mackenzie Guzman,45,Other,Finance,30
...,...,...,...,...,...,...,...
1593,49575,49576,Alexandra Mcdowell,64,Male,Sales,30
1594,49695,49696,Alexa Ellis,49,Male,Sales,30
1595,49703,49704,Wesley Bennett,43,Male,Sales,30
1596,49780,49781,Jeffrey Perry,26,Male,Sales,30
1597,49917,49918,Andrew Landry,50,Other,Sales,30

### Display how many employees in each department have a PhD education level.

In [33]:
phd_edu = df[df['Education Level'] == 'PhD'].groupby('Department').size()
phd_edu

Department
Finance       2015
HR            2100
IT            2039
Marketing     2088
Operations    2174
Sales         2068
dtype: int64